//
//  Data.swift
//  SWIFTUI_HW
//
//  Created by Александр Мосолов on 02.11.2025.
//

import SwiftUI

     let posts = [
         Post(title: "Russia",
              description: "Россия (официальное название — Российская Федерация) — крупнейшая по территории страна мира, расположенная в Восточной Европе и Северной Азии. Она занимает одну восьмую часть суши Земли и простирается через 11 часовых поясов",
              image: Image("russia")),
         Post(title: "USA",
              description: "Соединённые Штаты Америки (США) — это федеративная республика в Северной Америке, состоящая из 50 штатов и округа Колумбия, а также ряда островных территорий",
              image: Image("usa")),
         Post(title: "Italy",
              description: "Италия, официально Итальянская Республика (итал. Repubblica Italiana), — государство в Южной Европе, расположенное в центре Средиземноморья на Апеннинском полуострове, а также на островах Сицилия и Сардиния и ряде более мелких островов",
              image: Image("italy")),
     ]
